## Plan Result (688: zr_prod_acr - TerraformPlanApply)




<pre><code>Plan: 9 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.zr_acr[&#34;hmctsprod-cft-aks-aat-mi-pull&#34;]
  * azurerm_role_assignment.zr_acr[&#34;hmctsprod-cft-aks-demo-mi-pull&#34;]
  * azurerm_role_assignment.zr_acr[&#34;hmctsprod-cft-aks-ithc-mi-pull&#34;]
  * azurerm_role_assignment.zr_acr[&#34;hmctsprod-cft-aks-perftest-mi-pull&#34;]
  * azurerm_role_assignment.zr_acr[&#34;hmctsprod-cft-aks-preview-mi-pull&#34;]
  * azurerm_role_assignment.zr_acr[&#34;hmctsprod-cft-aks-prod-mi-pull&#34;]
  * azurerm_role_assignment.zr_acr[&#34;hmctsprod-cft-aks-ptl-intsvc-mi-pull&#34;]
  * azurerm_role_assignment.zr_acr[&#34;hmctsprod-cft-aks-sbox-intsvc-mi-pull&#34;]
  * azurerm_role_assignment.zr_acr[&#34;hmctsprod-cft-aks-sbox-mi-pull&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.zr_acr["hmctsprod-cft-aks-aat-mi-pull"] will be created
  + resource "azurerm_role_assignment" "zr_acr" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "9a2e3549-c5aa-4f7b-bcf8-1e1b3baf864c"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg/providers/Microsoft.ContainerRegistry/registries/hmctsprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.zr_acr["hmctsprod-cft-aks-demo-mi-pull"] will be created
  + resource "azurerm_role_assignment" "zr_acr" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a16e4c77-50e4-467f-9a3f-6b5f809b271d"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg/providers/Microsoft.ContainerRegistry/registries/hmctsprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.zr_acr["hmctsprod-cft-aks-ithc-mi-pull"] will be created
  + resource "azurerm_role_assignment" "zr_acr" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fcf1fd52-1e62-4827-b8f7-7088bc9dd488"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg/providers/Microsoft.ContainerRegistry/registries/hmctsprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.zr_acr["hmctsprod-cft-aks-perftest-mi-pull"] will be created
  + resource "azurerm_role_assignment" "zr_acr" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "396e0bf7-3416-4f89-b2f3-a2dfc9c53fa2"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg/providers/Microsoft.ContainerRegistry/registries/hmctsprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.zr_acr["hmctsprod-cft-aks-preview-mi-pull"] will be created
  + resource "azurerm_role_assignment" "zr_acr" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "916381c3-3565-4fa9-80bc-1e7754942106"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg/providers/Microsoft.ContainerRegistry/registries/hmctsprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.zr_acr["hmctsprod-cft-aks-prod-mi-pull"] will be created
  + resource "azurerm_role_assignment" "zr_acr" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "718712f6-94f0-4014-b7f7-c8a0ce967894"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg/providers/Microsoft.ContainerRegistry/registries/hmctsprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.zr_acr["hmctsprod-cft-aks-ptl-intsvc-mi-pull"] will be created
  + resource "azurerm_role_assignment" "zr_acr" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8670dd40-c5ab-4877-bdb3-64e4e1ade6b9"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg/providers/Microsoft.ContainerRegistry/registries/hmctsprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.zr_acr["hmctsprod-cft-aks-sbox-intsvc-mi-pull"] will be created
  + resource "azurerm_role_assignment" "zr_acr" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "47029ea9-8c0b-48e7-a2dc-ae43f2ba1833"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg/providers/Microsoft.ContainerRegistry/registries/hmctsprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.zr_acr["hmctsprod-cft-aks-sbox-mi-pull"] will be created
  + resource "azurerm_role_assignment" "zr_acr" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ff47ab8f-e4d9-48f2-ad31-af5933824849"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg/providers/Microsoft.ContainerRegistry/registries/hmctsprod"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```

</details>





## :warning: Errors

* failed to add a label 688: zr_prod_acr - TerraformPlanApply/add-or-update: label name is too long (max: 50)
<!-- github-comment: {"Command":"plan","PRNumber":53,"Program":"tfcmt","SHA1":"","Target":"688: zr_prod_acr - TerraformPlanApply","Vars":{}} -->